In [14]:
import pandas as pd

# Get data

In [15]:
df = pd.read_excel('20250808_yoyo_intermittent_recovery_level_1.xlsx')
df.head(5)

                       naam  speed_level  shuttle  speed  distance
0  Biswese Pumbulu Erik-Jan           18        1   16.5      1760
1          Bolou Benedition           14        2   14.5       520
2          Bruyninckx Ylano            0        0    0.0         0
3             De Byser Noah            0        0    0.0         0
4              De Cock Luis            0        0    0.0         0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   naam         36 non-null     object
 1   speed_level  36 non-null     int64
 2   shuttle      36 non-null     int64
 3   speed        36 non-null     float64
 4   distance     36 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.5+ KB

# Transform data

In [17]:
df['vo2max'] = df['distance'] * 0.0084 + 36.4
df.head(10)

                       naam  speed_level  shuttle  speed  distance  vo2max
0  Biswese Pumbulu Erik-Jan           18        1   16.5      1760  51.184
1          Bolou Benedition           14        2   14.5       520  40.768
2          Bruyninckx Ylano            0        0    0.0         0  36.400
3             De Byser Noah            0        0    0.0         0  36.400
4              De Cock Luis            0        0    0.0         0  36.400
5           De Ridder Seppe           20        7   17.5      2640  58.576
6          De Vriendt Senne           20        4   17.5      2520  57.568
7            Decuyper Seppe           21        2   18.0      2760  59.584
8             Dereez Artuur           23        8   19.0      3640  66.976
9            Frijns Mattias           19        2   17.0      2120  54.208